using Godot;
namespace ColdNight.src.game;


/// <summary>
/// Реализующие этот интерфейс имеют специфичное поведение относительно значений с которыми они работают
/// </summary>
public interface IAutoResetInput
{
    /// <summary>
    /// Если в течение этого времени не будет входных данных, направление вращения будет сброшено в ноль.
    /// Применяется только если существует входной сигнал.
    /// </summary>
    [Export] public bool ResetInput {get;set;}

    /// <summary>
    /// Если в течение этого времени не будет входных данных, направление вращения будет сброшено в ноль.
    /// 
    /// Это касается только если существует входной сигнал и разрешено <see cref="ResetInput"/>.
    /// Если входной сигнал отсутствует, направление вращения не сбрасывается.
    /// </summary>
    [Export] public double ResetInputTime {get;set;}
}