using Godot;

namespace ColdNight.src.common;

/// <summary>
/// Объекты реализующие этот интерфейс могут использовать `<see cref="RayCast3D"/>` в качестве
/// единой информационной базы. Они могут брать данные о мире исходя из результатов этого объекта всего
/// единожды за такт, в то время как если бы они не могли, то им бы приходилось вручную добывать данные
/// каждый новый рейкаст.
/// 
/// Это позволяет существенно сэкономить на рейкастах.
/// </summary>
public interface IRayCast3DCompatible
{
    /// <summary>
    /// Объект, на который ссылаются для получения информации о мире через систему рейкастов
    /// </summary>
    [Export] public RayCast3D? ReferencedRayCastInfo {get;set;}
}