using ColdNight.src.common;
using Godot;

namespace ColdNight.src;

/// <summary>
/// Объект может получать какие-либо данные и преобразовывать их на свое усмотрение
/// 
/// Объект, получающий по этому интерфейсу какую-либо информацию не обязан предусматривать ее
/// использование в кратчайшие сроки. Он может делать это реактивно или отложенно, в общей сути
/// смотря как он реализован
/// </summary>
public interface IWireReceiver
{
    /// <summary>
    /// Входящий порт для получения данных откуда угодно
    /// </summary>
    [Export] public WireIn? Input {get;set;}
}