namespace ColdNight.src.common;


/// <summary>
/// Объект гарантированно использует PID калькулятор и рассчитывает задачи с его помощью
/// 
/// Не рекомендуется на 1 класс иметь несколько PID калькуляторов, поскольку задачи
/// требующие разных инструментов не должны совмещать эти инструменты в 1 мультитул
/// </summary>
public interface ICalculatedPID
{
    /// <summary>
    /// Внутренний контроллер, который используется для рассчетов PID задач
    /// </summary>
    PIDCalculator Calculator {get; set;}
}