namespace ColdNight.src.common;


/// <summary>
/// Объект гарантированно использует PD калькулятор и рассчитывает задачи с его помощью
/// 
/// Не рекомендуется на 1 класс иметь несколько PD калькуляторов, поскольку задачи
/// требующие разных инструментов не должны совмещать эти инструменты в 1 мультитул
/// </summary>
public interface ICalculatedP
{
    /// <summary>
    /// Внутренний контроллер, который используется для рассчетов PD задач
    /// </summary>
    PCalculator Calculator {get; set;}
}